app/controllers/access_controller.rb

  def menu
    user = User.find_by_id(session[:user_id])
    meetings = user.meetings
    @past_meetings = []
    @next_meetings = []
    meetings.each do |meeting|
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "meetings".* FROM "meetings" INNER JOIN "meeting_people" ON "meetings"."id" = "meeting_people"."meeting_id" WHERE "meeting_people"."user_id" = 1

  def edit
    @user = User.find_by_id(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def update
    @user = User.find_by_id(session[:user_id])
    if @user.update_attributes(params[:user])
      if @user.name
        session[:username] = @user.name
      else
        session[:username] = @user.email
      end
      flash[:notice] = "Profile updated."
      redirect_to(:action => 'menu')
    else
      flash[:notice] = ""
      @user.errors.full_messages.each do |msg|
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "name" = 'João Duro', "updated_at" = '2011-12-07 17:48:52.728447' WHERE "users"."id" = 1
SELECT 1 FROM "users" WHERE ("users"."email" = 'joao_duro@msn.com' AND "users"."id" != 1) LIMIT 1