app/controllers/meeting_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def new
    @meeting = Meeting.new
    #@meeting.topics.build
    if session[:user_id]
      @manager = User.find_by_id(session[:user_id])